cask_args appdir: "/Applications"

# Additional taps
tap "blendle/blendle"
tap "bramstein/webfonttools"
tap "homebrew/cask"

# Brews to be installed

brew "azure-cli"
brew "aws-shell"
brew "coreutils"
brew "dnsmasq"
brew "findutils"
brew "fzf"
brew "fontconfig"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-credential-manager"
brew "gnupg"
brew "go"
brew "grep"
brew "htop"
brew "iftop"
brew "kubernetes-cli"
brew "kubectx"
brew "kubernetes-helm"
brew "kns"
brew "legit"
brew "lnav"
brew "lolcat"
brew "lynx"
brew "mackup"
brew "mas"
brew "moreutils"
brew "mtr"
brew "nmap"
brew "node"
brew "openssh"
brew "p7zip"
brew "python"
brew "python3"
brew "screen"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "stern"
brew "tcptrace"
brew "tcpreplay"
brew "tcpflow"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "trash"
brew "tree"
brew "watch"
brew "wget"
brew "wifi-password"
brew "woff2"
brew "xpdf"

# Casks to be installed

cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "alfred"
cask "bartender"
# cask "bettertouchtool"
cask "cacher"
cask "charles"
cask "cleanmymac"
cask "diffmerge"
cask "docker"
cask "dropbox"
cask "firefox"
cask "gitkraken"
cask "google-chrome"
cask "handbrake"
cask "hyper"
cask "iterm2"
cask "launchrocket"
cask "lastpass"
cask "licecap"
cask "microsoft-office"
cask "microsoft-teams"
cask "minikube"
cask "muzzle"
cask "parallels"
cask "powershell"
cask "private-internet-access"
cask "quicklook-json"
cask "quicklook-csv"
cask "skype"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "suspicious-package"
cask "textexpander"
cask "transmission"
cask "vagrant"
cask "vlc"
cask "virtualbox"
cask "visual-studio-code"
cask "whatsapp"
cask "yammer"
cask "zoomus"